app/controllers/api/sports_controller.rb

SELECT "sports".* FROM "sports"
---
  def index
    sports = Sport.all