backend/app/controllers/api/stats_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def create
		user = User.find(params[:user_id])