backend/app/controllers/api/stats_controller.rb

	def create
		respond_to do |format|
			user = user_exist?("jgbCP2MuzW5yAPkGGWEmzQ",params[:user_id])
			stat = Stat.new(user_id:params[:user_id],sport_id: params[:sport_id], active: true)
			if user && stat.save
---
INSERT INTO "stats" ("user_id", "sport_id", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["sport_id", 3], ["active", true], ["created_at", 2016-11-06 01:53:23 UTC], ["updated_at", 2016-11-06 01:53:23 UTC]]

	def update
		respond_to do |format|
			user = user_exist?("jgbCP2MuzW5yAPkGGWEmzQ",params[:user_id])
			if user
				stat = Stat.find(params[:id])
---
SELECT  "stats".* FROM "stats" WHERE "stats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]