backend/app/controllers/api/users_controller.rb

  def show
    respond_to do |format|
      user = User.find(params[:id]) if User.exists?(params[:user][:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 30], ["LIMIT", 1]]